KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/MCApplication/src/MCTasks.c
/**
  ******************************************************************************
  * @file    MCTasks.c
  * @author  STMicroelectronics - System Lab - MC Team
  * @version 4.0.0
  * @date    28-May-2014 10:45
  * @brief   This file implementes tasks definition
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

/* Pre-compiler coherency check */
#define MC_APPLICATION_CHK
#include "CrossCheck.h" 
#undef MC_APPLICATION_CHK

//#include "MCTaskFunction.h"
#include "PIRegulatorClass.h"
#include "PID_PIRegulatorClass.h"
#include "DigitalOutputClass.h"
#include "MC_type.h"
#include "MC_Math.h"
#include "MCIRQHandlerClass.h"

#include "SpeednPosFdbkClass.h"
#include "STO_SpeednPosFdbkClass.h"
#include "HiFreqInj_FPU_SpeednPosFdbkClass.h"
#include "ENCODER_SpeednPosFdbkClass.h"
#include "HALL_SpeednPosFdbkClass.h"
#include "HALL_F30X_SpeednPosFdbkClass.h"
#include "STO_CORDIC_SpeednPosFdbkClass.h"
#include "VirtualSpeedSensor_SpeednPosFdbkClass.h"
#include "EncAlignCtrlClass.h"

#include "HiFreqInj_FPU_CtrlClass.h"
#include "OpenLoopClass.h"
#include "FluxWeakeningCtrlClass.h"
#include "FeedForwardCtrlClass.h"
#include "MTPACtrlClass.h"
#include "CircleLimitationClass.h"

#include "PWMnCurrFdbkClass.h"

/* PWMC derived class includes */
#include "R3_LM1_PWMnCurrFdbkClass.h"
#include "R3_HD2_PWMnCurrFdbkClass.h"
#include "R1_LM1_PWMnCurrFdbkClass.h"
#include "R1_VL1_PWMnCurrFdbkClass.h"
#include "R1_HD2_PWMnCurrFdbkClass.h"
#include "ICS_LM1_PWMnCurrFdbkClass.h"
#include "ICS_HD2_PWMnCurrFdbkClass.h"
#include "R3_F2XX_PWMnCurrFdbkClass.h"
#include "R1_F2XX_PWMnCurrFdbkClass.h"
#include "ICS_F2XX_PWMnCurrFdbkClass.h"
#include "R3_F4XX_PWMnCurrFdbkClass.h"
#include "R1_F4XX_PWMnCurrFdbkClass.h"
#include "ICS_F4XX_PWMnCurrFdbkClass.h"
#include "R1_F0XX_PWMnCurrFdbkClass.h"
#include "R3_2_F30X_PWMnCurrFdbkClass.h"
#include "R3_4_F30X_PWMnCurrFdbkClass.h"
#include "R1_F30X_PWMnCurrFdbkClass.h"
#include "ICS_F30X_PWMnCurrFdbkClass.h"

#include "StateMachineClass.h"
#include "SpeednTorqCtrlClass.h"
#include "RevupCtrlClass.h"

#include "BusVoltageSensorClass.h"
#include "Rdivider_BusVoltageSensorClass.h"
#include "Virtual_BusVoltageSensorClass.h"

#include "DigitalOutputClass.h"

#include "TemperatureSensorClass.h"
#include "NTC_TemperatureSensorClass.h"
#include "Virtual_TemperatureSensorClass.h"

#include "MotorPowerMeasurementClass.h"
#include "PQD_MotorPowerMeasurementClass.h"

#include "InrushCurrentLimiterClass.h"

#include "MCInterfaceClass.h"
#include "MCInterfaceClassPrivate.h"
#include "MCTuningClass.h"
#include "MCTuningClassPrivate.h"

// To be moved into xxx_params.h
#define CHARGE_BOOT_CAP_ENABLING        ENABLE
#define CHARGE_BOOT_CAP_ENABLING2       ENABLE
#define CHARGE_BOOT_CAP_MS  10
#define CHARGE_BOOT_CAP_MS2 10
#define OFFCALIBRWAIT_MS     0
#define OFFCALIBRWAIT_MS2    0
#define STOPPERMANENCY_MS  400
#define STOPPERMANENCY_MS2 400
#define CHARGE_BOOT_CAP_TICKS  (uint16_t)((SYS_TICK_FREQUENCY * CHARGE_BOOT_CAP_MS)/ 1000)   // or WB
#define CHARGE_BOOT_CAP_TICKS2 (uint16_t)((SYS_TICK_FREQUENCY * CHARGE_BOOT_CAP_MS2)/ 1000)  // or WB
#define OFFCALIBRWAITTICKS     (uint16_t)((SYS_TICK_FREQUENCY * OFFCALIBRWAIT_MS)/ 1000)     // or WB
#define OFFCALIBRWAITTICKS2    (uint16_t)((SYS_TICK_FREQUENCY * OFFCALIBRWAIT_MS2)/ 1000)    // or WB
#define STOPPERMANENCY_TICKS   (uint16_t)((SYS_TICK_FREQUENCY * STOPPERMANENCY_MS)/ 1000)    // or WB
#define STOPPERMANENCY_TICKS2  (uint16_t)((SYS_TICK_FREQUENCY * STOPPERMANENCY_MS2)/ 1000)   // or WB

#include "SystemNDriveParams.h"

#include "MCTasks.h"
#include "MC.h"

#define MC_TUNING_INTERFACE

/* Private define ------------------------------------------------------------*/
#define AUX_SPEED_FDBK_M1 (defined(VIEW_HALL_FEEDBACK) || defined(VIEW_ENCODER_FEEDBACK) || defined(AUX_STATE_OBSERVER_PLL) || defined(AUX_STATE_OBSERVER_CORDIC))
#define AUX_SPEED_FDBK_M2 (defined(VIEW_HALL_FEEDBACK2) || defined(VIEW_ENCODER_FEEDBACK2) || defined(AUX_STATE_OBSERVER_PLL2) || defined(AUX_STATE_OBSERVER_CORDIC2))

/* Private variables----------------------------------------------------------*/
FOCVars_t FOCVars[NBR_OF_MOTORS];

CMCI oMCInterface[NBR_OF_MOTORS];
#ifdef MC_TUNING_INTERFACE
CMCT oMCTuning[NBR_OF_MOTORS];
#endif
CSTM oSTM[NBR_OF_MOTORS];
CSTC oSTC[NBR_OF_MOTORS];
CPI oPIDSpeed[NBR_OF_MOTORS],oPIDIq[NBR_OF_MOTORS],oPIDId[NBR_OF_MOTORS];
CVBS oBusSensor[NBR_OF_MOTORS];
CTSNS oTemperatureSensor[NBR_OF_MOTORS];
CPWMC oCurrSensor[NBR_OF_MOTORS];  
CSPD oSpeedSensor[NBR_OF_MOTORS]; 
CDOUT oR_Brake[NBR_OF_MOTORS];
CDOUT oOCPDisabling[NBR_OF_MOTORS];
CMPM oMPM[NBR_OF_MOTORS];
CCLM oCLM[NBR_OF_MOTORS];

#if AUX_SPEED_FDBK_M1
CSPD oSpeedSensorAux_M1;              /* only if auxiliary speed sensor on M1*/
#endif 
#if ((defined NO_SPEED_SENSORS)||(defined ENCODER)||(defined VIEW_ENCODER_FEEDBACK))
CSPD oVSS_M1;                         /* only if M1 is sensorless*/
#endif
#if (defined NO_SPEED_SENSORS)
CRUC oRUC_M1;                         /* only if M1 is sensorless*/
#endif
#if ((defined ENCODER)||(defined VIEW_ENCODER_FEEDBACK))
CEAC oEAC_M1;
#endif
#if defined(FLUX_WEAKENING) || (defined(DUALDRIVE) && defined(FLUX_WEAKENING2))
CFW oFW[NBR_OF_MOTORS];     /* only if M1 or M2 has FW */
CPI oPIFW[NBR_OF_MOTORS];   /* only if M1 or M2 has FW */
#endif
#if defined(FEED_FORWARD_CURRENT_REGULATION) || (defined(DUALDRIVE) && defined(FEED_FORWARD_CURRENT_REGULATION2))
CFF oFF[NBR_OF_MOTORS];     /* only if M1 or M2 has FF */
#endif
#if defined(IPMSM_MTPA) || (defined(DUALDRIVE) && defined(IPMSM_MTPA2))
CMTPA oMTPA[2] = {MC_NULL,MC_NULL}; /* only if M1 or M2 has MTPA */
#endif
#if defined(OPEN_LOOP) || (defined(DUALDRIVE) && defined(OPEN_LOOP2))
COL oOL[2] = {MC_NULL,MC_NULL};     /* only if M1 or M2 has OPEN LOOP */
#endif
#if (defined(SINGLEDRIVE) && defined(HFINJECTION))
CHFI_FP oHFI[NBR_OF_MOTORS] = {MC_NULL};/* only if M1 has HFI */
#elif (defined(DUALDRIVE) && (defined(HFINJECTION) || defined(HFINJECTION2)))
CHFI_FP oHFI[NBR_OF_MOTORS] = {MC_NULL,MC_NULL};/* only if M1 or M2 has HFI */
#endif

#ifdef DUALDRIVE
#if AUX_SPEED_FDBK_M2
CSPD oSpeedSensorAux_M2;              /* only if auxiliary speed sensor on M2*/  
#endif
#if ((defined NO_SPEED_SENSORS2)||(defined ENCODER2)||(defined VIEW_ENCODER_FEEDBACK2))
CSPD oVSS_M2;                         /* only if M2 is sensorless*/
#endif
#if (defined NO_SPEED_SENSORS2)
CRUC oRUC_M2;                         /* only if M2 is sensorless*/
#endif
#if ((defined ENCODER2)||(defined VIEW_ENCODER_FEEDBACK2))
CEAC oEAC_M2;
#endif
#endif

