KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/MCApplication/src/MCTasks.c
#if ((defined NO_SPEED_SENSORS)||(defined ENCODER)||(defined VIEW_ENCODER_FEEDBACK))
  oVSS_M1 = (CSPD)VSS_NewObject(&SpeednPosFdbkParamsM1,&VirtualSpeedSensorParamsM1);
  SPD_Init(oVSS_M1);
#endif
#if (defined NO_SPEED_SENSORS)
  oRUC_M1 = RUC_NewObject(&RevupCtrlParamsM1);        /* only if sensorless*/
  RUC_Init(oRUC_M1,oSTC[M1],(CVSS_SPD)oVSS_M1);        /* only if sensorless*/
#endif
#if ((defined ENCODER)||(defined VIEW_ENCODER_FEEDBACK))
  oEAC_M1 = (CEAC)EAC_NewObject(&EncAlignCtrlParamsM1);
#endif
#if (defined ENCODER)
  EAC_Init(oEAC_M1,oSTC[M1],(CVSS_SPD)oVSS_M1,(CENC_SPD)oSpeedSensor[M1]);
#endif  
#if (defined VIEW_ENCODER_FEEDBACK)
  EAC_Init(oEAC_M1,oSTC[M1],(CVSS_SPD)oVSS_M1,(CENC_SPD)oSpeedSensorAux_M1);
#endif
  
  oPIDIq[M1] = (CPI)PI_NewObject(&PIIqParamsM1);
  PI_ObjectInit(oPIDIq[M1]); 
  
  oPIDId[M1] = (CPI)PI_NewObject(&PIIdParamsM1);
  PI_ObjectInit(oPIDId[M1]);   
  
#if defined BUS_VOLTAGE_MEASUREMENT
  oBusSensor[M1] = (CVBS)RVBS_NewObject(&RealBusVoltageSensorParamsM1,
                                       &RdividerParamsM1); /* powerboard configuration: Rdivider or Virtual*/  
#else
  oBusSensor[M1] = (CVBS)VVBS_NewObject(&VirtualBusVoltageSensorParamsM1,
                                       &VirtualBusParamsM1); /* powerboard configuration: Rdivider or Virtual*/    
#endif
  VBS_Init(oBusSensor[M1],oCurrSensor[M1]);
  
  oMPM[M1] = (CMPM)PQD_NewObject(&PQD_MotorPowerMeasurementParamsM1);
  PQD_MPMInitStruct.pFOCVars = &FOCVars[M1];
  PQD_MPMInitStruct.oVBS = oBusSensor[M1];
  MPM_Init(oMPM[M1],(pMPMInitStruct_t)&PQD_MPMInitStruct);
  
#if ON_OVER_VOLTAGE == TURN_ON_R_BRAKE
  oR_Brake[M1] = DOUT_NewObject(&R_BrakeParamsM1); 
  DOUT_Init(oR_Brake[M1]);
#endif 

  
#if defined HEAT_SINK_TEMPERATURE_MEASUREMENT
  oTemperatureSensor[M1] = (CTSNS)NTC_NewObject(&RealTempSensorParamsM1,
                                               &NTCParamsM1); /* powerboard configuration: NTC or Virtual*/
#else
  oTemperatureSensor[M1] = (CTSNS)VTS_NewObject(&VirtualTempSensorParamsM1,
                                               &VirtualTParamsM1); /* powerboard configuration: NTC or Virtual*/
#endif
  TSNS_Init(oTemperatureSensor[M1],oCurrSensor[M1]);  
  
#if defined(FLUX_WEAKENING)
  oPIFW[M1] = (CPI)PI_NewObject(&PIFluxWeakeningParamsM1);  /* only if M1 has FW */
  PI_ObjectInit(oPIFW[M1]);                                 /* PI_ObjectInit or PID_ObjectInit*/
  FWInitStructureM1.oFluxWeakeningPI = oPIFW[M1];           /* only if M1 has FW */
  FWInitStructureM1.oSpeedPI = oPIDSpeed[M1];                /* only if M1 has FW */
  FW_Init(oFW[M1],&FWInitStructureM1);                      /* only if M1 has FW */
#endif
  
#if defined(FEED_FORWARD_CURRENT_REGULATION)
  FFInitStructureM1.oVBS = oBusSensor[M1]; /* only if M1 has FF */
  FFInitStructureM1.oPI_q = oPIDIq[M1];    /* only if M1 has FF */
  FFInitStructureM1.oPI_d = oPIDId[M1];    /* only if M1 has FF */
  FF_Init(oFF[M1],&FFInitStructureM1);     /* only if M1 has FF */
#endif
  
#if defined(OPEN_LOOP)
  OL_Init(oOL[M1], oVSS_M1);     /* only if M1 has open loop */
#endif
  
#if defined(HFINJECTION) 
  HFI_FP_InitStructureM1.oHFI_FP_SpeedSensor = (CHFI_FP_SPD)(oSpeedSensor[M1]); /* only if M1 has HFI */
  HFI_FP_InitStructureM1.pFOCVarsPtr = &FOCVars[M1];                            /* only if M1 has HFI */
  HFI_FP_InitStructureM1.oPI_q = oPIDIq[M1];                                    /* only if M1 has HFI */
  HFI_FP_InitStructureM1.oPI_d = oPIDId[M1];                                    /* only if M1 has HFI */
  HFI_FP_InitStructureM1.oVbusSensor = oBusSensor[M1];                          /* only if M1 has HFI */
  HFI_FP_Init(oHFI[M1], &HFI_FP_InitStructureM1);                               /* only if M1 has HFI */
#endif
  
  FOCVars[M1].bDriveInput = EXTERNAL;
  FOCVars[M1].Iqdref = STC_GetDefaultIqdref(oSTC[M1]);
  FOC_Clear(M1);
  
  oMCInterface[M1] = MCI_NewObject(MC_NULL);
  MCI_Init(oMCInterface[M1], oSTM[M1], oSTC[M1], &FOCVars[M1]);
  MCI_ExecSpeedRamp(oMCInterface[M1], 
  STC_GetMecSpeedRef01HzDefault(oSTC[M1]),0); /*First command to STC*/
  
  oMCIList[M1] = oMCInterface[M1];

#ifdef MC_TUNING_INTERFACE
  oMCTuning[M1] = MCT_NewObject(MC_NULL);
  
  MCTInitStruct.oPIDSpeed = oPIDSpeed[M1];
  MCTInitStruct.oPIDIq = oPIDIq[M1];
  MCTInitStruct.oPIDId = oPIDId[M1];
#if defined(FLUX_WEAKENING)
  MCTInitStruct.oPIDFluxWeakening = oPIFW[M1]; /* only if M1 has FW */
#else
  MCTInitStruct.oPIDFluxWeakening = MC_NULL; /* if M1 doesn't has FW */
#endif
  MCTInitStruct.oPWMnCurrFdbk = oCurrSensor[M1];
#if (defined NO_SPEED_SENSORS)  
  MCTInitStruct.oRevupCtrl = oRUC_M1;              /* only if M1 is sensorless*/
#else
  MCTInitStruct.oRevupCtrl = MC_NULL;              /* only if M1 is not sensorless*/
#endif
  MCTInitStruct.oSpeedSensorMain = oSpeedSensor[M1];
#if (AUX_SPEED_FDBK_M1)
  MCTInitStruct.oSpeedSensorAux = oSpeedSensorAux_M1; /* only if M1 has auxiliary sensor oSpeedSensorAux_M1*/
#else
  MCTInitStruct.oSpeedSensorAux = MC_NULL;            /* only if M1 has auxiliary sensor oSpeedSensorAux_M1*/
#endif
#if (defined NO_SPEED_SENSORS)
  MCTInitStruct.oSpeedSensorVirtual = oVSS_M1;  /* only if M1 is sensorless*/
#endif
  MCTInitStruct.oSpeednTorqueCtrl = oSTC[M1];
  MCTInitStruct.oStateMachine = oSTM[M1];
  MCTInitStruct.oTemperatureSensor = oTemperatureSensor[M1];
  MCTInitStruct.oBusVoltageSensor = oBusSensor[M1];
  MCTInitStruct.oBrakeDigitalOutput = MC_NULL;   /* brake is defined, oBrakeM1*/
  MCTInitStruct.oNTCRelay = MC_NULL;             /* relay is defined, oRelayM1*/
  MCTInitStruct.oMPM = oMPM[M1];
#if defined(FLUX_WEAKENING)
  MCTInitStruct.oFW = oFW[M1];
#else
  MCTInitStruct.oFW = MC_NULL;
#endif
#if defined(FEED_FORWARD_CURRENT_REGULATION)
  MCTInitStruct.oFF = oFF[M1];
#else
  MCTInitStruct.oFF = MC_NULL;
#endif
#if defined(HFINJECTION)
  MCTInitStruct.oHFI = oHFI[M1];
#else
  MCTInitStruct.oHFI = MC_NULL;
#endif

  MCT_Init(oMCTuning[M1],MCTInitStruct);
  
  oMCTList[M1] = oMCTuning[M1];
#endif

#ifdef DUALDRIVE
  oSTM[M2] = STM_NewObject();
  STM_Init(oSTM[M2]);
  
  oPIDSpeed[M2] = (CPI)PI_NewObject(&PISpeedParamsM2);
  PI_ObjectInit(oPIDSpeed[M2]); 

#if (defined HFINJECTION2)
  oSpeedSensor[M2] = (CSPD)HFI_FP_SPD_NewObject(&SpeednPosFdbkParamsM2,&HiFreqInjParamsM2); /* only if M2 has HFI */
#elif (defined STATE_OBSERVER_PLL2) 
  oSpeedSensor[M2] = (CSPD)STO_NewObject(&SpeednPosFdbkParamsM2,&STOParamsM2); /* speed sensor STO, ENC, HALL xNew and xParamsM2*/
#elif (defined STATE_OBSERVER_CORDIC2) 
  oSpeedSensor[M2] = (CSPD)STO_CR_NewObject(&SpeednPosFdbkParamsM2,&STO_CORDICParamsM2); /* speed sensor STO, ENC, HALL xNew and xParamsM2*/  
#elif (defined ENCODER2)
  oSpeedSensor[M2] = (CSPD)ENC_NewObject(&SpeednPosFdbkParamsM2,&ENCParamsM2); /* speed sensor STO, ENC, HALL xNew and xParamsM2*/
#elif (defined HALL_SENSORS2)
  #if (defined(STM32F30X))
    oSpeedSensor[M2] = (CSPD)HALL_F30X_NewObject(&SpeednPosFdbkParamsM2,&HALL_F30XParamsM2); /* speed sensor STO, ENC, HALL xNew and xParamsM2*/  
  #else /* Any other micros */
    oSpeedSensor[M2] = (CSPD)HALL_NewObject(&SpeednPosFdbkParamsM2,&HALLParamsM2); /* speed sensor STO, ENC, HALL xNew and xParamsM2*/  
  #endif  
#else
#error "Invalid boot: configuration not valid or to be assigned"
#endif
  
  SPD_Init(oSpeedSensor[M2]);
  
#if AUX_SPEED_FDBK_M2 
#if (defined AUX_STATE_OBSERVER_PLL2)
  oSpeedSensorAux_M2 = (CSPD)STO_NewObject(&SpeednPosFdbkParamsM2,&STOParamsM2); /* aux speed sensor STO, ENC, HALL xNew and xParamsM2*/
#elif (defined AUX_STATE_OBSERVER_CORDIC2)
  oSpeedSensorAux_M2 = (CSPD)STO_CR_NewObject(&SpeednPosFdbkParamsM2,&STO_CORDICParamsM2); /* aux speed sensor STO, ENC, HALL xNew and xParamsM2*/  
#elif (defined VIEW_ENCODER_FEEDBACK2)
  oSpeedSensorAux_M2 = (CSPD)ENC_NewObject(&SpeednPosFdbkParamsM2,&ENCParamsM2); /* aux speed sensor STO, ENC, HALL xNew and xParamsM2*/
#elif (defined VIEW_HALL_FEEDBACK2)
  #if (defined(STM32F30X))
    oSpeedSensorAux_M2 = (CSPD)HALL_F30X_NewObject(&SpeednPosFdbkParamsM2,&HALL_F30XParamsM2); /* aux speed sensor STO, ENC, HALL xNew and xParamsM2*/  
  #else /* Any other micros */
    oSpeedSensorAux_M2 = (CSPD)HALL_NewObject(&SpeednPosFdbkParamsM2,&HALLParamsM2); /* aux speed sensor STO, ENC, HALL xNew and xParamsM2*/
  #endif
#endif  
  SPD_Init(oSpeedSensorAux_M2);
#endif
  
  oSTC[M2] = STC_NewObject(&SpeednTorqCtrlParamsM2);
  STC_Init(oSTC[M2],oPIDSpeed[M2],oSpeedSensor[M2]);

#if ((defined NO_SPEED_SENSORS2)||(defined ENCODER2)||(defined VIEW_ENCODER_FEEDBACK2))
  oVSS_M2 = (CSPD)VSS_NewObject(&SpeednPosFdbkParamsM2,&VirtualSpeedSensorParamsM2);
  SPD_Init(oVSS_M2);                               
#endif
#if (defined NO_SPEED_SENSORS2)  
  oRUC_M2 = RUC_NewObject(&RevupCtrlParamsM2);        /* only if sensorless*/
  RUC_Init(oRUC_M2,oSTC[M2],(CVSS_SPD)oVSS_M2);        /* only if sensorless*/
#endif
#if ((defined ENCODER2)||(defined VIEW_ENCODER_FEEDBACK2))  
  oEAC_M2 = (CEAC)EAC_NewObject(&EncAlignCtrlParamsM2);
#endif
#if (defined ENCODER2)
  EAC_Init(oEAC_M2,oSTC[M2],(CVSS_SPD)oVSS_M2,(CENC_SPD)oSpeedSensor[M2]);
#endif
#if (defined VIEW_ENCODER_FEEDBACK2)
  EAC_Init(oEAC_M2,oSTC[M2],(CVSS_SPD)oVSS_M2,(CENC_SPD)oSpeedSensorAux_M2);
#endif  
  
  oPIDIq[M2] = (CPI)PI_NewObject(&PIIqParamsM2);
  PI_ObjectInit(oPIDIq[M2]);
  
