KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/MCApplication/src/MCTasks.c
  oPIDId[M2] = (CPI)PI_NewObject(&PIIdParamsM2);
  PI_ObjectInit(oPIDId[M2]);   

#if defined BUS_VOLTAGE_MEASUREMENT2
  oBusSensor[M2] = (CVBS)RVBS_NewObject(&RealBusVoltageSensorParamsM2,
                                       &RdividerParamsM2); /* powerboard configuration: Rdivider or Virtual*/  
#else
  oBusSensor[M2] = (CVBS)VVBS_NewObject(&VirtualBusVoltageSensorParamsM2,
                                       &VirtualBusParamsM2); /* powerboard configuration: Rdivider or Virtual*/    
#endif  
  VBS_Init(oBusSensor[M2],oCurrSensor[M1]);
  
  oMPM[M2] = (CMPM)PQD_NewObject(&PQD_MotorPowerMeasurementParamsM2);
  PQD_MPMInitStruct.pFOCVars = &FOCVars[M2];
  PQD_MPMInitStruct.oVBS = oBusSensor[M2];
  MPM_Init(oMPM[M2],(pMPMInitStruct_t)&PQD_MPMInitStruct);
  
#if ON_OVER_VOLTAGE2 == TURN_ON_R_BRAKE
  oR_Brake[M2] = DOUT_NewObject(&R_BrakeParamsM2); 
  DOUT_Init(oR_Brake[M2]);
#endif
  
#if defined HEAT_SINK_TEMPERATURE_MEASUREMENT2
  oTemperatureSensor[M2] = (CTSNS)NTC_NewObject(&RealTempSensorParamsM2,
                                               &NTCParamsM2); /* powerboard configuration: NTC or Virtual*/
#else
  oTemperatureSensor[M2] = (CTSNS)VTS_NewObject(&VirtualTempSensorParamsM2,
                                               &VirtualTParamsM2); /* powerboard configuration: NTC or Virtual*/
#endif
  
  TSNS_Init(oTemperatureSensor[M2],oCurrSensor[M1]);  
  
#if defined(FLUX_WEAKENING2)
  oPIFW[M2] = (CPI)PI_NewObject(&PIFluxWeakeningParamsM2);  /* only if M2 has FW */
  PI_ObjectInit(oPIFW[M2]);                                 /* PI_ObjectInit or PID_ObjectInit*/
  FWInitStructureM2.oFluxWeakeningPI = oPIFW[M2];           /* only if M2 has FW */
  FWInitStructureM2.oSpeedPI = oPIDSpeed[M2];                /* only if M2 has FW */
  FW_Init(oFW[M2],&FWInitStructureM2);                      /* only if M2 has FW */
#endif
  
#if defined(FEED_FORWARD_CURRENT_REGULATION2)
  FFInitStructureM2.oVBS = oBusSensor[M2]; /* only if M2 has FF */
  FFInitStructureM2.oPI_q = oPIDIq[M2];    /* only if M2 has FF */
  FFInitStructureM2.oPI_d = oPIDId[M2];    /* only if M2 has FF */
  FF_Init(oFF[M2],&FFInitStructureM2);    /* only if M2 has FF */
#endif
  
#if defined(OPEN_LOOP2)
  OL_Init(oOL[M2], oVSS_M2);     /* only if M2 has open loop */
#endif
  
#if defined(HFINJECTION2) 
  HFI_FP_InitStructureM2.oHFI_FP_SpeedSensor = (CHFI_FP_SPD)(oSpeedSensor[M2]); /* only if M2 has HFI */
  HFI_FP_InitStructureM2.pFOCVarsPtr = &FOCVars[M2];                            /* only if M2 has HFI */
  HFI_FP_InitStructureM2.oPI_q = oPIDIq[M2];                                    /* only if M2 has HFI */
  HFI_FP_InitStructureM2.oPI_d = oPIDId[M2];                                    /* only if M2 has HFI */
  HFI_FP_InitStructureM2.oVbusSensor = oBusSensor[M2];                          /* only if M1 has HFI */
  HFI_FP_Init(oHFI[M2], &HFI_FP_InitStructureM2);                               /* only if M2 has HFI */
#endif
  
  FOCVars[M2].bDriveInput = EXTERNAL;
  FOCVars[M2].Iqdref = STC_GetDefaultIqdref(oSTC[M2]);
  FOC_Clear(M2);
    
  oMCInterface[M2] = MCI_NewObject(MC_NULL);
  MCI_Init(oMCInterface[M2], oSTM[M2], oSTC[M2], &FOCVars[M2]);
  MCI_ExecSpeedRamp(oMCInterface[M2], 
  STC_GetMecSpeedRef01HzDefault(oSTC[M2]),0); /*First command to STC*/
  
  oMCIList[M2] = oMCInterface[M2]; 
    
#ifdef MC_TUNING_INTERFACE
  oMCTuning[M2] = MCT_NewObject(MC_NULL);
  
  MCTInitStruct.oPIDSpeed = oPIDSpeed[M2];
  MCTInitStruct.oPIDIq = oPIDIq[M2];
  MCTInitStruct.oPIDId = oPIDId[M2];
#if defined(FLUX_WEAKENING2)
  MCTInitStruct.oPIDFluxWeakening = oPIFW[M2]; /* only if M2 has FW */
#else
  MCTInitStruct.oPIDFluxWeakening = MC_NULL; /* if M2 doesn't has FW */
#endif
  MCTInitStruct.oPWMnCurrFdbk = oCurrSensor[M2];
#if (defined NO_SPEED_SENSORS2)  
  MCTInitStruct.oRevupCtrl = oRUC_M2;              /* only if M2 is sensorless*/
#else
  MCTInitStruct.oRevupCtrl = MC_NULL;              /* only if M2 is not sensorless*/
#endif
  MCTInitStruct.oSpeedSensorMain = oSpeedSensor[M2];
#if (AUX_SPEED_FDBK_M2)
  MCTInitStruct.oSpeedSensorAux = oSpeedSensorAux_M2; /* only if M2 has auxiliary sensor oSpeedSensorAux_M2*/
#else
  MCTInitStruct.oSpeedSensorAux = MC_NULL;            /* only if M2 has auxiliary sensor oSpeedSensorAux_M2*/
#endif

#if (defined NO_SPEED_SENSORS2)
  MCTInitStruct.oSpeedSensorVirtual = oVSS_M2;  /* only if M2 is sensorless*/
#endif
  MCTInitStruct.oSpeednTorqueCtrl = oSTC[M2];
  MCTInitStruct.oStateMachine = oSTM[M2];
  MCTInitStruct.oTemperatureSensor = oTemperatureSensor[M2];
  MCTInitStruct.oBusVoltageSensor = oBusSensor[M2];
  MCTInitStruct.oBrakeDigitalOutput = MC_NULL;   /* brake is defined, oBrakeM2*/
  MCTInitStruct.oNTCRelay = MC_NULL;             /* relay is defined, oRelayM2*/
  MCTInitStruct.oMPM = oMPM[M2];
#if defined(FLUX_WEAKENING2)
  MCTInitStruct.oFW = oFW[M2];
#else
  MCTInitStruct.oFW = MC_NULL;
#endif
#if defined(FEED_FORWARD_CURRENT_REGULATION2)
  MCTInitStruct.oFF = oFF[M2];
#else
  MCTInitStruct.oFF = MC_NULL;
#endif
#if defined(HFINJECTION2)
  MCTInitStruct.oHFI = oHFI[M2];
#else
  MCTInitStruct.oHFI = MC_NULL;
#endif
  
  MCT_Init(oMCTuning[M2],MCTInitStruct);
  
  oMCTList[M2] = oMCTuning[M2];
#endif
#endif  
  
#if (INRUSH_CURRLIMIT_ENABLING == ENABLE)
  oICLDOUT_M1 = DOUT_NewObject(&ICLDOUTParamsM1);
  DOUT_Init(oICLDOUT_M1);
  oICL_M1 = ICL_NewObject(&InrushCurrentLimiterParamsM1);
  ICL_Init(oICL_M1, oBusSensor[M1], oICLDOUT_M1);
  STM_NextState(oSTM[M1],ICLWAIT);
#endif 
#if (INRUSH_CURRLIMIT_ENABLING2 == ENABLE)
  oICLDOUT_M2 = DOUT_NewObject(&ICLDOUTParamsM2);
  DOUT_Init(oICLDOUT_M2);
  oICL_M2 = ICL_NewObject(&InrushCurrentLimiterParamsM2);
  ICL_Init(oICL_M2, oBusSensor[M2], oICLDOUT_M2);
  STM_NextState(oSTM[M2],ICLWAIT);
#endif
}

/**
  * @brief  It executes MC tasks: safety task and medium frequency for all
  *         drive instances. It have to be clocked with Systick frequnecy.
  * @param  None
  * @retval None
  */
void MC_Scheduler(void)
{
  if(hMFTaskCounterM1 > 0u)
  {
    hMFTaskCounterM1--;
  }   
  else
  {
   TSK_MediumFrequencyTaskM1();
/****************************** USE ONLY FOR SDK 4.0 EXAMPLES *************/  
#if defined(EXAMPLE_SPEEDMONITOR)
   ARR_TIM5_update(oSpeedSensor[M1]); 
#endif
/**************************************************************************/    
   hMFTaskCounterM1 = MF_TASK_OCCURENCE_TICKS;
  } 
    
#ifdef DUALDRIVE
  if(hMFTaskCounterM2 > 0u)
  {
    hMFTaskCounterM2--;
  }   
  else
  {
    TSK_MediumFrequencyTaskM2();
    hMFTaskCounterM2 = MF_TASK_OCCURENCE_TICKS2;
  }
#endif
  
  if(hBootCapDelayCounterM1 > 0u)
  {
    hBootCapDelayCounterM1--;    
  } 
  if(hStopPermanencyCounterM1 > 0u)
  {
    hStopPermanencyCounterM1--;    
  }
#ifdef DUALDRIVE
  if(hBootCapDelayCounterM2 > 0u)
  {
    hBootCapDelayCounterM2--;    
  }
  if(hStopPermanencyCounterM2 > 0u)
  {
    hStopPermanencyCounterM2--;    
  }
#endif
}

/**
  * @brief  It executes some of the control duties on Motor 1 accordingly with  
  *         the present state of its state machine. In particular, duties 
  *         requiring a specific timing (e.g. speed controller) are here 
  *         executed
  * @param  None
  * @retval void
  */
void TSK_MediumFrequencyTaskM1(void)
{
  State_t StateM1;
  bool IsSpeedReliable;
  int16_t wAux = 0;
  
