KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/MCApplication/src/MCTasks.c
#if (INRUSH_CURRLIMIT_ENABLING == ENABLE)
  ICLState_t ICLState = ICL_Exec(oICL_M1);
#endif
  
#if (defined(VIEW_HALL_FEEDBACK)||defined(VIEW_ENCODER_FEEDBACK)||defined(AUX_STATE_OBSERVER_PLL)||defined(AUX_STATE_OBSERVER_CORDIC))
  bool IsSpeedReliableAux = SPD_CalcAvrgMecSpeed01Hz(oSpeedSensorAux_M1,&wAux);  /*  Only if Aux sensored is enabled */
#endif  
  
  IsSpeedReliable = SPD_CalcAvrgMecSpeed01Hz(oSpeedSensor[M1],&wAux);
  
  MPM_CalcElMotorPower(oMPM[M1]);
  
  StateM1 = STM_GetState(oSTM[M1]);
  switch(StateM1)
  {
#if (INRUSH_CURRLIMIT_ENABLING == ENABLE)
  case ICLWAIT:
    if (ICLState == ICL_INACTIVE)
    {
      /* If ICL Inactive move to IDLE */
      STM_NextState(oSTM[M1],IDLE);
    }
    break;
#endif
    
#if ((defined ENCODER)||(defined VIEW_ENCODER_FEEDBACK)) /*  only for encoder*/
  case IDLE:
    if (EAC_GetRestartState(oEAC_M1))
    {
      EAC_SetRestartState(oEAC_M1,FALSE); /* Reset restart flag*/
      STM_NextState(oSTM[M1],IDLE_START);
    }
    break;
#endif
    
  case IDLE_START:
#if ((defined ENCODER)||(defined VIEW_ENCODER_FEEDBACK)) /*  only for encoder*/
    if (EAC_IsAligned(oEAC_M1) == FALSE)
    {
      EAC_SetRestartState(oEAC_M1,TRUE); /* Set restart flag. Run after align*/
      STM_NextState(oSTM[M1],IDLE_ALIGNMENT);
      break;
    }
#endif
#if (CHARGE_BOOT_CAP_ENABLING == ENABLE)
    PWMC_TurnOnLowSides(oCurrSensor[M1]); 
    TSK_SetChargeBootCapDelayM1(CHARGE_BOOT_CAP_TICKS);
    STM_NextState(oSTM[M1],CHARGE_BOOT_CAP);
#else
    PWMC_CurrentReadingCalibr(oCurrSensor[M1],CRC_START);
    STM_NextState(oSTM[M1],OFFSET_CALIB);
#endif
    break;
  
#if (CHARGE_BOOT_CAP_ENABLING == ENABLE)
  case CHARGE_BOOT_CAP:
    if (TSK_ChargeBootCapDelayHasElapsedM1())
    {
      PWMC_CurrentReadingCalibr(oCurrSensor[M1],CRC_START);
      STM_NextState(oSTM[M1],OFFSET_CALIB);
    }
    break;
#endif
    
  case OFFSET_CALIB:
    if (PWMC_CurrentReadingCalibr(oCurrSensor[M1],CRC_EXEC))
    {
      STM_NextState(oSTM[M1],CLEAR);
    }
    break;
    
  case CLEAR:
#if (defined NO_SPEED_SENSORS)      
    FOCVars[M1].bDriveInput = EXTERNAL;                               /* only for sensorless */
    STC_SetSpeedSensor(oSTC[M1],oVSS_M1);                             /* only for sensorless */
    RUC_Clear(oRUC_M1,MCI_GetImposedMotorDirection(oMCInterface[M1])); /* only for sensorless */
#endif
    
#if (defined HFINJECTION)
    STC_SetSpeedSensor(oSTC[M1],oSpeedSensor[M1]);
#endif

    SPD_Clear(oSpeedSensor[M1]); 		/*  only for sensorless/hall/encoder main*/
#if (defined(AUX_STATE_OBSERVER_PLL) || defined(AUX_STATE_OBSERVER_CORDIC) || defined(VIEW_HALL_FEEDBACK) || defined(VIEW_ENCODER_FEEDBACK))
    SPD_Clear(oSpeedSensorAux_M1); 		/*  only for sensorless/hall main/auxiliary*/
#endif
    if(STM_NextState(oSTM[M1], START) == TRUE)
    {
      FOC_Clear(M1);
      PWMC_SwitchOnPWM(oCurrSensor[M1]); 
    }
    break;
    
#if ((defined ENCODER)||(defined VIEW_ENCODER_FEEDBACK)) /*  only for encoder*/
    case IDLE_ALIGNMENT:
#if (CHARGE_BOOT_CAP_ENABLING == ENABLE)
    PWMC_TurnOnLowSides(oCurrSensor[M1]); 
    TSK_SetChargeBootCapDelayM1(CHARGE_BOOT_CAP_TICKS);
    STM_NextState(oSTM[M1],ALIGN_CHARGE_BOOT_CAP);
#else
    PWMC_CurrentReadingCalibr(oCurrSensor[M1],CRC_START);
    STM_NextState(oSTM[M1],ALIGN_OFFSET_CALIB);
#endif
    break;
  
#if (CHARGE_BOOT_CAP_ENABLING == ENABLE)
  case ALIGN_CHARGE_BOOT_CAP:
    if (TSK_ChargeBootCapDelayHasElapsedM1())
    {
      PWMC_CurrentReadingCalibr(oCurrSensor[M1],CRC_START);
      STM_NextState(oSTM[M1],ALIGN_OFFSET_CALIB);
    }
    break;
#endif
    
  case ALIGN_OFFSET_CALIB:
    if (PWMC_CurrentReadingCalibr(oCurrSensor[M1],CRC_EXEC))
    {
      STM_NextState(oSTM[M1],ALIGN_CLEAR);
    }
    break;
    
  case ALIGN_CLEAR:
    FOCVars[M1].bDriveInput = EXTERNAL;
    STC_SetSpeedSensor(oSTC[M1],oVSS_M1);
    EAC_StartAlignment(oEAC_M1);
    
    if(STM_NextState(oSTM[M1], ALIGNMENT) == TRUE)
    {
      FOC_Clear(M1);
      PWMC_SwitchOnPWM(oCurrSensor[M1]); 
    }
    break;
#endif
    
  case START:
    {    
#if (defined NO_SPEED_SENSORS)  /* only for sensor-less control */  
      
      int16_t hForcedMecSpeed01Hz;
      Curr_Components IqdRef;
      bool StartUpTransitionEnded;
      bool StartUpDoTransition;
      
      if(!RUC_Exec(oRUC_M1))
      {
        #if (OPEN_LOOP_FOC == ENABLE)
          /* No error generated when OPEN LOOP is enabled. */
        #else
          STM_FaultProcessing(oSTM[M1], MC_START_UP, 0);  /*Time allowed for startup has ended*/
        #endif
      }
      
      StartUpTransitionEnded = SPD_CalcAvrgMecSpeed01Hz(oVSS_M1,&hForcedMecSpeed01Hz);
      
      #if (OPEN_LOOP_FOC == ENABLE)
      {
        int16_t hOLFinalMecSpeed01Hz = MCI_GetLastRampFinalSpeed(oMCInterface[M1]);
        if (hOLFinalMecSpeed01Hz != VSPD_GetLastRampFinalSpeed(oVSS_M1))
        {
          VSPD_SetMecAcceleration(oVSS_M1,hOLFinalMecSpeed01Hz,OPEN_LOOP_SPEED_RAMP_DURATION_MS);
        }
        OL_Calc(oOL[M1]);
      }
      #endif
      
      IqdRef.qI_Component1 = STC_CalcTorqueReference(oSTC[M1]);
      IqdRef.qI_Component2 = 0;
      FOCVars[M1].Iqdref = IqdRef;
      
#if (defined(STATE_OBSERVER_PLL))
      StartUpDoTransition = VSPD_SetStartTransition(oVSS_M1,STO_IsObserverConverged((CSTO_SPD)oSpeedSensor[M1],hForcedMecSpeed01Hz));
#elif (defined(STATE_OBSERVER_CORDIC))
      StartUpDoTransition = VSPD_SetStartTransition(oVSS_M1,STO_CR_IsObserverConverged((CSTO_CR_SPD)oSpeedSensor[M1],hForcedMecSpeed01Hz));
#endif
      
      if (StartUpDoTransition == FALSE)
      {
        StartUpTransitionEnded = TRUE;
      }
      
      if (StartUpTransitionEnded == TRUE)
      {
        {      
          Curr_Components StatorCurrent;
          StatorCurrent = FOCVars[M1].Ialphabeta;
          StatorCurrent = MCM_Park(StatorCurrent, SPD_GetElAngle(oSpeedSensor[M1]));
          PI_SetIntegralTerm(oPIDSpeed[M1],(int32_t)StatorCurrent.qI_Component1*PI_GetKIDivisor(oPIDSpeed[M1])); 
        }        
        STM_NextState(oSTM[M1], START_RUN);
      }
#endif
    
