KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/MCApplication/src/MCTasks.c
#if ((defined ENCODER)||(defined HALL_SENSORS))
      STM_NextState(oSTM[M1], START_RUN); /* only for sensored*/
#endif
      
#if (defined HFINJECTION)
      /* HFI validation check */
      if (HFI_FP_Start(oHFI[M1]) == TRUE)
      {
        STM_NextState(oSTM[M1], START_RUN);
      }
#endif
    }
    break;
#if ((defined ENCODER)||(defined VIEW_ENCODER_FEEDBACK))
  case ALIGNMENT:
    if(!EAC_Exec(oEAC_M1))
    {
      Curr_Components IqdRef;
      IqdRef.qI_Component1 = 0;
      IqdRef.qI_Component2 = STC_CalcTorqueReference(oSTC[M1]);
      FOCVars[M1].Iqdref = IqdRef;	
    }
    else
    {
      PWMC_SwitchOffPWM(oCurrSensor[M1]);
      STC_SetControlMode(oSTC[M1], STC_SPEED_MODE);
      STC_SetSpeedSensor(oSTC[M1],oSpeedSensor[M1]);
      STM_NextState(oSTM[M1], ANY_STOP);
    }    
    break;    
#endif
  case START_RUN:
    MCI_ExecBufferedCommands(oMCInterface[M1]);
    
#if (defined NO_SPEED_SENSORS) /* only for sensor-less control */
    STC_SetSpeedSensor(oSTC[M1], oSpeedSensor[M1]); /*Observer has converged*/
#endif
    
#if (defined HFINJECTION)
    if (!HFI_FP_STMRUN(oHFI[M1]))
    {
      STM_FaultProcessing(oSTM[M1], MC_SPEED_FDBK, 0);
    }
    else      
#endif 
    {
      FOC_InitAdditionalMethods(M1);    
      FOC_CalcCurrRef(M1);
      STM_NextState(oSTM[M1], RUN);
    }
    break;
  case RUN:
    MCI_ExecBufferedCommands(oMCInterface[M1]);
    FOC_CalcCurrRef(M1);
#if (defined HFINJECTION)
    if (STC_GetSpeedSensor(oSTC[M1]) == oSpeedSensor[M1])
    {
      int16_t hObsSpeed01Hz = SPD_GetAvrgMecSpeed01Hz((CSPD)oSpeedSensorAux_M1);
      int16_t hHFISpeedDpp = SPD_GetElSpeedDpp(oSpeedSensor[M1]);
      int32_t wtemp = (int32_t)hHFISpeedDpp * (int32_t)hObsSpeed01Hz;
      
      if(!IsSpeedReliable)
      {
        STM_FaultProcessing(oSTM[M1], MC_SPEED_FDBK, 0);
      }      
      
      if (wtemp < 0)
      {
        STO_SetPLL((CSTO_SPD)oSpeedSensorAux_M1, hHFISpeedDpp,
        SPD_GetElAngle(oSpeedSensor[M1]));      
      }      
      
      if (!HFI_FP_SPD_AccelerationStageReached((CHFI_FP_SPD)oSpeedSensor[M1]))
      {
        STO_SetPLL((CSTO_SPD)oSpeedSensorAux_M1, SPD_GetElSpeedDpp(oSpeedSensor[M1]),
                   SPD_GetElAngle(oSpeedSensor[M1]));        
      } 
      else
      {
        if (STO_IsObserverConverged((CSTO_SPD)oSpeedSensorAux_M1,SPD_GetAvrgMecSpeed01Hz(oSpeedSensor[M1])))
        {
          STC_SetSpeedSensor(oSTC[M1], oSpeedSensorAux_M1);
          HFI_FP_DisHFGeneration(oHFI[M1]);           
        }
      }
    }
    else  /* STO - HFI */
    {
      int16_t hObsSpeed01Hz = SPD_GetAvrgMecSpeed01Hz((CSPD)oSpeedSensorAux_M1);
      
      if(!IsSpeedReliableAux)
      {
        STM_FaultProcessing(oSTM[M1], MC_SPEED_FDBK, 0);
      }       
      
      if (HFI_FP_SPD_Restart((CHFI_FP_SPD)oSpeedSensor[M1],hObsSpeed01Hz))
      {
        if (HFI_FP_Restart(oHFI[M1]) == TRUE)
        {
          if (HFI_FP_SPD_IsConverged((CHFI_FP_SPD)oSpeedSensor[M1],hObsSpeed01Hz))
          {
            SPD_Clear(oSpeedSensor[M1]);
            HFI_FP_SPD_SetElAngle((CHFI_FP_SPD)oSpeedSensor[M1],SPD_GetElAngle((CSPD)oSpeedSensorAux_M1));          
            HFI_FP_SPD_SetElSpeedDpp((CHFI_FP_SPD)oSpeedSensor[M1],-SPD_GetElSpeedDpp((CSPD)oSpeedSensorAux_M1));            
            HFI_FP_SPD_SetAvrgMecSpeed01Hz((CHFI_FP_SPD)oSpeedSensor[M1],-SPD_GetAvrgMecSpeed01Hz((CSPD)oSpeedSensorAux_M1));
            HFI_FP_SPD_SetHFState((CHFI_FP_SPD)oSpeedSensor[M1],TRUE);
            HFI_FP_STMRUN(oHFI[M1]);
            STC_SetSpeedSensor(oSTC[M1],oSpeedSensor[M1]);
          }
        }
      }
      else
      {
        HFI_FP_DisHFGeneration(oHFI[M1]);
      }   
    }
#else
    if(!IsSpeedReliable)
    {
      STM_FaultProcessing(oSTM[M1], MC_SPEED_FDBK, 0);
    } 
#endif
    break;
    
  case ANY_STOP:
    PWMC_SwitchOffPWM(oCurrSensor[M1]);    
    FOC_Clear(M1);
    MPM_Clear(oMPM[M1]);
    TSK_SetStopPermanencyTimeM1(STOPPERMANENCY_TICKS);
    STM_NextState(oSTM[M1], STOP);
    break;
  case STOP:
    if(TSK_StopPermanencyTimeHasElapsedM1())
    {
      STM_NextState(oSTM[M1], STOP_IDLE);
    }
    break;
  case STOP_IDLE:
#if (defined NO_SPEED_SENSORS)    
    STC_SetSpeedSensor(oSTC[M1],oVSS_M1);  	/*  sensor-less */
#endif
    
#if (defined HFINJECTION)    
    HFI_FP_DisHFGeneration(oHFI[M1]);
#endif    
    
#if (INRUSH_CURRLIMIT_ENABLING == ENABLE)
    STM_NextState(oSTM[M1], ICLWAIT);
#else
    STM_NextState(oSTM[M1], IDLE);
#endif
    break;
  default:
    break;    
  }
}

/**
  * @brief  It re-initializes the current and voltage variables. Moreover
  *         it clears qd currents PI controllers, voltage sensor and SpeednTorque 
  *         controller. It must be called before each motor restart. 
  *         It does not clear speed sensor. 
  * @param  bMotor related motor it can be M1 or M2
  * @retval none
  */
void FOC_Clear(uint8_t bMotor)
{
  Curr_Components Inull = {(int16_t)0, (int16_t)0};
  Volt_Components Vnull = {(int16_t)0, (int16_t)0};
  
  FOCVars[bMotor].Iab = Inull;
  FOCVars[bMotor].Ialphabeta = Inull;
  FOCVars[bMotor].Iqd = Inull;
  FOCVars[bMotor].Iqdref = Inull;
  FOCVars[bMotor].hTeref = (int16_t)0;
  FOCVars[bMotor].Vqd = Vnull;
  FOCVars[bMotor].Valphabeta = Vnull;   
  FOCVars[bMotor].hElAngle = (int16_t)0;
  
  PI_SetIntegralTerm(oPIDIq[bMotor], (int32_t)0);
  PI_SetIntegralTerm(oPIDId[bMotor], (int32_t)0);
  
  STC_Clear(oSTC[bMotor]);
  
  PWMC_SwitchOffPWM(oCurrSensor[bMotor]);
  
#if defined(FLUX_WEAKENING) || (defined(DUALDRIVE) && defined(FLUX_WEAKENING2))
  if (oFW[bMotor])
  {
    FW_Clear(oFW[bMotor]);
  }
#endif
  
#if defined(FEED_FORWARD_CURRENT_REGULATION) || (defined(DUALDRIVE) && defined(FEED_FORWARD_CURRENT_REGULATION2))
  if (oFF[bMotor])
  {
    FF_Clear(oFF[bMotor]);
  }
#endif
  
#if defined(HFINJECTION) || (defined(DUALDRIVE) && defined(HFINJECTION2))
  if (oHFI[bMotor])
  {
    HFI_FP_Clear(oHFI[bMotor]);
  }
#endif
}

/**
  * @brief  Use this method to initialize additional methods (if any) in 
  *         START_TO_RUN state
  * @param  bMotor related motor it can be M1 or M2 
  * @retval none
  */
void FOC_InitAdditionalMethods(uint8_t bMotor)
{
#if defined(FEED_FORWARD_CURRENT_REGULATION) || (defined(DUALDRIVE) && defined(FEED_FORWARD_CURRENT_REGULATION2))
  if (oFF[M1])
  {
    FF_InitFOCAdditionalMethods(oFF[M1]);
  }
#endif
}

/**
  * @brief  It computes the new values of Iqdref (current references on qd 
  *         reference frame) based on the required electrical torque information
  *         provided by oTSC object (internally clocked). 
  *         If implemented in the derived class it executes flux weakening and/or
  *         MTPA algorithm(s). It must be called with the periodicity specified  
  *         in oTSC parameters
  * @param  bMotor related motor it can be M1 or M2 
  * @retval none
  */
void FOC_CalcCurrRef(uint8_t bMotor)
{
  if(FOCVars[bMotor].bDriveInput == INTERNAL)
  {
    FOCVars[bMotor].hTeref = STC_CalcTorqueReference(oSTC[bMotor]);
    
