KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/MCApplication/src/MCTasks.c
      if(!RUC_Exec(oRUC_M2))
      {
        #if (OPEN_LOOP_FOC2 == ENABLE)
          /* No error generated when OPEN LOOP is enabled. */
        #else
          STM_FaultProcessing(oSTM[M2], MC_START_UP, 0);  /*Time allowed for startup has ended*/
        #endif
      }
      
      StartUpTransitionEnded = SPD_CalcAvrgMecSpeed01Hz(oVSS_M2,&hForcedMecSpeed01Hz);
      
      #if (OPEN_LOOP_FOC2 == ENABLE)
      {
        int16_t hOLFinalMecSpeed01Hz = MCI_GetLastRampFinalSpeed(oMCInterface[M2]);
        if (hOLFinalMecSpeed01Hz != VSPD_GetLastRampFinalSpeed(oVSS_M2))
        {
          VSPD_SetMecAcceleration(oVSS_M2,hOLFinalMecSpeed01Hz,OPEN_LOOP_SPEED_RAMP_DURATION_MS2);
        }
        OL_Calc(oOL[M2]);
      }
      #endif
            
      IqdRef.qI_Component1 = STC_CalcTorqueReference(oSTC[M2]);
      IqdRef.qI_Component2 = 0;
      FOCVars[M2].Iqdref = IqdRef;
      
#if (defined(STATE_OBSERVER_PLL2))
      StartUpDoTransition = VSPD_SetStartTransition(oVSS_M2,STO_IsObserverConverged((CSTO_SPD)oSpeedSensor[M2],hForcedMecSpeed01Hz));
#elif (defined(STATE_OBSERVER_CORDIC2))
      StartUpDoTransition = VSPD_SetStartTransition(oVSS_M2,STO_CR_IsObserverConverged((CSTO_CR_SPD)oSpeedSensor[M2],hForcedMecSpeed01Hz));
#endif
      
      if (StartUpDoTransition == FALSE)
      {
        StartUpTransitionEnded = TRUE;
      }      
      
      if (StartUpTransitionEnded == TRUE)
      {
        {      
          Curr_Components StatorCurrent;
          StatorCurrent = FOCVars[M2].Ialphabeta;
          StatorCurrent = MCM_Park(StatorCurrent, SPD_GetElAngle(oSpeedSensor[M2]));
          PI_SetIntegralTerm(oPIDSpeed[M2],(int32_t)StatorCurrent.qI_Component1*PI_GetKIDivisor(oPIDSpeed[M2])); 
        }        
        STM_NextState(oSTM[M2], START_RUN);
      }
    }
#endif
    /* only for sensored*/
#if ((defined ENCODER2)||(defined HALL_SENSORS2))
        STM_NextState(oSTM[M2], START_RUN);
#endif
      
#if (defined HFINJECTION2)
      /* HFI validation check */
      if (HFI_FP_Start(oHFI[M2]) == TRUE)
      {
        STM_NextState(oSTM[M2], START_RUN);
      }
#endif
    break;
#if ((defined ENCODER2)||(defined VIEW_ENCODER_FEEDBACK2)) /*  only for encoder*/
  case ALIGNMENT:
    if(!EAC_Exec(oEAC_M2))
    {
      Curr_Components IqdRef;
      IqdRef.qI_Component1 = 0;
      IqdRef.qI_Component2 = STC_CalcTorqueReference(oSTC[M2]);
      FOCVars[M2].Iqdref = IqdRef;	
    }
    else
    {
      PWMC_SwitchOffPWM(oCurrSensor[M2]);
      STC_SetControlMode(oSTC[M2], STC_SPEED_MODE);
      STC_SetSpeedSensor(oSTC[M2], oSpeedSensor[M2]);
      STM_NextState(oSTM[M2], ANY_STOP);
    }    
    break;    
#endif    
  case START_RUN:
    MCI_ExecBufferedCommands(oMCInterface[M2]);
    
#if (defined NO_SPEED_SENSORS2) /* only for sensor-less control */
    STC_SetSpeedSensor(oSTC[M2],oSpeedSensor[M2]);  /*Observer has converged*/
#endif
    
#if (defined HFINJECTION2)
    if (!HFI_FP_STMRUN(oHFI[M2]))
    {
      STM_FaultProcessing(oSTM[M2], MC_SPEED_FDBK, 0);
    }
    else
#endif
    {
      FOC_InitAdditionalMethods(M2);    
      FOC_CalcCurrRef(M2);
      STM_NextState(oSTM[M2], RUN);
    }
    break;
  case RUN:
    MCI_ExecBufferedCommands(oMCInterface[M2]);
    FOC_CalcCurrRef(M2);
#if (defined HFINJECTION2)
    if (STC_GetSpeedSensor(oSTC[M2]) == oSpeedSensor[M2])
    {
      int16_t hObsSpeed01Hz = SPD_GetAvrgMecSpeed01Hz((CSPD)oSpeedSensorAux_M2);
      int16_t hHFISpeedDpp = SPD_GetElSpeedDpp(oSpeedSensor[M2]);
      int32_t wtemp = (int32_t)hHFISpeedDpp * (int32_t)hObsSpeed01Hz;
      
      if(!IsSpeedReliable)
      {
        STM_FaultProcessing(oSTM[M2], MC_SPEED_FDBK, 0);
      } 
      
      if (wtemp < 0)
      {
        STO_SetPLL((CSTO_SPD)oSpeedSensorAux_M2, hHFISpeedDpp,
        SPD_GetElAngle(oSpeedSensor[M2]));      
      }      
      
      if (!HFI_FP_SPD_AccelerationStageReached((CHFI_FP_SPD)oSpeedSensor[M2]))
      {
        STO_SetPLL((CSTO_SPD)oSpeedSensorAux_M2, SPD_GetElSpeedDpp(oSpeedSensor[M2]),
                   SPD_GetElAngle(oSpeedSensor[M2]));        
      } 
      else
      {
        if (STO_IsObserverConverged((CSTO_SPD)oSpeedSensorAux_M2,SPD_GetAvrgMecSpeed01Hz(oSpeedSensor[M2])))
        {
          STC_SetSpeedSensor(oSTC[M2], oSpeedSensorAux_M2);
          HFI_FP_DisHFGeneration(oHFI[M2]);           
        }
      }
    }
    else  /* STO - HFI */
    {
      int16_t hObsSpeed01Hz = SPD_GetAvrgMecSpeed01Hz((CSPD)oSpeedSensorAux_M2);
      
      if(!IsSpeedReliableAux)
      {
        STM_FaultProcessing(oSTM[M2], MC_SPEED_FDBK, 0);
      }
      
      if (HFI_FP_SPD_Restart((CHFI_FP_SPD)oSpeedSensor[M2],hObsSpeed01Hz))
      {
        if (HFI_FP_Restart(oHFI[M2]) == TRUE)
        {
          if (HFI_FP_SPD_IsConverged((CHFI_FP_SPD)oSpeedSensor[M2],hObsSpeed01Hz))
          {
            SPD_Clear(oSpeedSensor[M2]);
            HFI_FP_SPD_SetElAngle((CHFI_FP_SPD)oSpeedSensor[M2],SPD_GetElAngle((CSPD)oSpeedSensorAux_M2));
            HFI_FP_SPD_SetElSpeedDpp((CHFI_FP_SPD)oSpeedSensor[M2],-SPD_GetElSpeedDpp((CSPD)oSpeedSensorAux_M2));
            HFI_FP_SPD_SetAvrgMecSpeed01Hz((CHFI_FP_SPD)oSpeedSensor[M2],-SPD_GetAvrgMecSpeed01Hz((CSPD)oSpeedSensorAux_M2));
            HFI_FP_SPD_SetHFState((CHFI_FP_SPD)oSpeedSensor[M2],TRUE);
            HFI_FP_STMRUN(oHFI[M2]);
            STC_SetSpeedSensor(oSTC[M2],oSpeedSensor[M2]);
          }
        }
      }
      else
      {
        HFI_FP_DisHFGeneration(oHFI[M2]);
      }   
    }
#else
    if(!IsSpeedReliable)
    {
      STM_FaultProcessing(oSTM[M2], MC_SPEED_FDBK, 0);
    }
#endif
    break;
  case ANY_STOP:
    PWMC_SwitchOffPWM(oCurrSensor[M2]); 
    FOC_Clear(M2);
    MPM_Clear(oMPM[M2]);
    TSK_SetStopPermanencyTimeM2(40);
    STM_NextState(oSTM[M2], STOP);
    break;
  case STOP:
    if(TSK_StopPermanencyTimeHasElapsedM2())
    {
      STM_NextState(oSTM[M2], STOP_IDLE);
    }
    break;
  case STOP_IDLE:
#if (defined NO_SPEED_SENSORS2)    
    STC_SetSpeedSensor(oSTC[M2],oVSS_M2);  	/*  only for sensor-less */
#endif
    
#if (defined HFINJECTION2)
    HFI_FP_DisHFGeneration(oHFI[M2]);
#endif
    
#if (INRUSH_CURRLIMIT_ENABLING2 == ENABLE)
    STM_NextState(oSTM[M2], ICLWAIT);
#else
    STM_NextState(oSTM[M2], IDLE);
#endif
    break;
  default:
    break;    
  }
}

/**
  * @brief  It set a counter intended to be used for counting the delay required 
  *         for drivers boot capacitors charging of motor 2
  * @param  hTickCount number of ticks to be counted
  * @retval void
  */
void TSK_SetChargeBootCapDelayM2(uint16_t hTickCount)
{
   hBootCapDelayCounterM2 = hTickCount;    
}

/**
  * @brief  Use this function to know whether the time required to charge boot 
  *         capacitors of motor 2 has elapsed
  * @param  none
  * @retval bool TRUE if time has elapsed, FALSE otherwise
  */
bool TSK_ChargeBootCapDelayHasElapsedM2(void)
{
  bool retVal = FALSE;
  if (hBootCapDelayCounterM2 == 0)
  {
    retVal = TRUE;
  }
  return (retVal);
}

/**
  * @brief  It set a counter intended to be used for counting the permanency 
  *         time in STOP state of motor 2
  * @param  hTickCount number of ticks to be counted
  * @retval void
  */
void TSK_SetStopPermanencyTimeM2(uint16_t hTickCount)
{
  hStopPermanencyCounterM2 = hTickCount;  
}

/**
  * @brief  Use this function to know whether the permanency time in STOP state 
  *         of motor 2 has elapsed
  * @param  none
  * @retval bool TRUE if time is elapsed, FALSE otherwise
  */
bool TSK_StopPermanencyTimeHasElapsedM2(void)
{
  bool retVal = FALSE;
  if (hStopPermanencyCounterM2 == 0)
  {
    retVal = TRUE;
  }
  return (retVal);
}
#endif

#if defined (CCMRAM_ENABLED)
#if defined (__ICCARM__)
#pragma location = ".ccmram"
#elif defined (__CC_ARM)
__attribute__((section ("ccmram")))
#endif
#endif
/**
  * @brief  Accordingly with the present state(s) of the state machine(s), it 
  *         executes those motor control duties requiring a high frequency rate
  *         and a precise timing (e.g. FOC current control loop)
  * @param  None
  * @retval uint8_t It return the motor instance number of last executed FOC.
  */
uint8_t TSK_HighFrequencyTask(void)
{ 
  uint8_t bMotorNbr = 0;
  uint16_t hFOCreturn;
  
#ifdef SINGLEDRIVE

