KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/MCApplication/src/MCTasks.c
#if (defined NO_SPEED_SENSORS)
  uint16_t hState;  /*  only if sensorless main*/
#endif
#if ((defined STATE_OBSERVER_PLL)||(defined AUX_STATE_OBSERVER_PLL))
  Observer_Inputs_t STO_Inputs; /*  only if sensorless main/aux*/
#endif
#if (defined STATE_OBSERVER_PLL)
  bool IsAccelerationStageReached;
#endif
#if ((defined STATE_OBSERVER_CORDIC)||(defined AUX_STATE_OBSERVER_CORDIC))
  STO_CR_Observer_Inputs_t STO_CR_Inputs; /*  only if sensorless main/aux*/
#endif
  
#if ((defined ENCODER)||(defined HALL_SENSORS)||(defined HFINJECTION))
  SPD_CalcAngle(oSpeedSensor[M1],MC_NULL);   /* if not sensorless then 2nd parameter is MC_NULL*/    
#endif
#if ((defined VIEW_ENCODER_FEEDBACK)||(defined VIEW_HALL_FEEDBACK))    
  SPD_CalcAngle(oSpeedSensorAux_M1,MC_NULL);  /*  only if auxiliary sensor is enabled */  
#endif

#if ((defined STATE_OBSERVER_PLL)||(defined AUX_STATE_OBSERVER_PLL))
  STO_Inputs.Valfa_beta = FOCVars[M1].Valphabeta;  /* only if sensorless*/
#endif
#if ((defined STATE_OBSERVER_CORDIC)||(defined AUX_STATE_OBSERVER_CORDIC))
  STO_CR_Inputs.Valfa_beta = FOCVars[M1].Valphabeta;  /* only if sensorless*/
#endif  
  
  hFOCreturn = FOC_CurrController(M1);

  if(hFOCreturn == MC_FOC_DURATION)
  {
    STM_FaultProcessing(oSTM[M1], MC_FOC_DURATION, 0); 
  }
  else
  {
#if ((defined STATE_OBSERVER_PLL)||(defined AUX_STATE_OBSERVER_PLL))
    STO_Inputs.Ialfa_beta = FOCVars[M1].Ialphabeta; /*  only if sensorless*/
    
    STO_Inputs.Vbus = VBS_GetAvBusVoltage_d(oBusSensor[M1]); /*  only for sensorless*/
#endif    
#if ((defined STATE_OBSERVER_CORDIC)||(defined AUX_STATE_OBSERVER_CORDIC))
    STO_CR_Inputs.Ialfa_beta = FOCVars[M1].Ialphabeta; /*  only if sensorless*/
    
    STO_CR_Inputs.Vbus = VBS_GetAvBusVoltage_d(oBusSensor[M1]); /*  only for sensorless*/    
#endif    
#if (defined STATE_OBSERVER_PLL)
    IsAccelerationStageReached = RUC_FirstAccelerationStageReached(oRUC_M1);
    
    SPD_CalcAngle(oSpeedSensor[M1],&STO_Inputs);   /* if not sensorless then 2nd parameter is MC_NULL*/

    STO_CalcAvrgElSpeedDpp((CSTO_SPD) oSpeedSensor[M1]); /*  Only in case of Sensor-less */    
    
    if (IsAccelerationStageReached == FALSE)
    {
      STO_ResetPLL((CSTO_SPD)oSpeedSensor[M1]);
    }   
    
    hState = STM_GetState(oSTM[M1]);
    if((hState == START) || (hState == START_RUN)) /*  only for sensor-less*/
    {
      int16_t hObsAngle;
      hObsAngle = SPD_GetElAngle(oSpeedSensor[M1]);
      SPD_CalcAngle(oVSS_M1,&hObsAngle);
    }
#endif
#if (defined STATE_OBSERVER_CORDIC)
    SPD_CalcAngle(oSpeedSensor[M1],&STO_CR_Inputs);   /* if not sensorless then 2nd parameter is MC_NULL*/
    
    STO_CR_CalcAvrgElSpeedDpp((CSTO_CR_SPD) oSpeedSensor[M1]); /*  Only in case of Sensor-less */
    
    hState = STM_GetState(oSTM[M1]);
    if((hState == START) || (hState == START_RUN)) /*  only for sensor-less*/
    {
      int16_t hObsAngle;
      hObsAngle = SPD_GetElAngle(oSpeedSensor[M1]);      
      SPD_CalcAngle(oVSS_M1,&hObsAngle);  
    }
#endif    
#if (defined(AUX_STATE_OBSERVER_PLL))
    SPD_CalcAngle(oSpeedSensorAux_M1,&STO_Inputs);   /* if not sensorless then 2nd parameter is MC_NULL*/
    
    STO_CalcAvrgElSpeedDpp((CSTO_SPD) oSpeedSensorAux_M1); /*  Only in case of Sensor-less auxiliary*/
#endif
#if (defined(AUX_STATE_OBSERVER_CORDIC))
    SPD_CalcAngle(oSpeedSensorAux_M1,&STO_CR_Inputs);   /* if not sensorless then 2nd parameter is MC_NULL*/
    
    STO_CR_CalcAvrgElSpeedDpp((CSTO_CR_SPD) oSpeedSensorAux_M1); /*  Only in case of Sensor-less auxiliary*/
#endif        
  }
#else //DUALDRIVE

#if ((defined NO_SPEED_SENSORS)||(defined NO_SPEED_SENSORS2))
  uint16_t hState;  /*  only if, at least, one of the two motors is sensorless main*/
#endif
#if ((defined STATE_OBSERVER_PLL)||(defined AUX_STATE_OBSERVER_PLL)||(defined STATE_OBSERVER_PLL2)||(defined AUX_STATE_OBSERVER_PLL2))
  Observer_Inputs_t STO_Inputs; /*  only if sensorless main/aux*/
#endif
#if ((defined STATE_OBSERVER_PLL)||(defined STATE_OBSERVER_PLL2))
  bool IsAccelerationStageReached;
#endif
#if ((defined STATE_OBSERVER_CORDIC)||(defined AUX_STATE_OBSERVER_CORDIC)||(defined STATE_OBSERVER_CORDIC2)||(defined AUX_STATE_OBSERVER_CORDIC2))
  STO_CR_Observer_Inputs_t STO_CR_Inputs; /*  only if sensorless main/aux*/
#endif  
  
  bMotorNbr = *((uint8_t*)(FOC_array[FOC_array_head]));
  
  if (bMotorNbr == 0)
  {
#if ((defined STATE_OBSERVER_PLL)||(defined AUX_STATE_OBSERVER_PLL))
  STO_Inputs.Valfa_beta = FOCVars[bMotorNbr].Valphabeta;        /* only if motor0 is sensorless*/
#endif
#if ((defined STATE_OBSERVER_CORDIC)||(defined AUX_STATE_OBSERVER_CORDIC))
  STO_CR_Inputs.Valfa_beta = FOCVars[bMotorNbr].Valphabeta;     /* only if motor0 is sensorless*/
#endif
    
#if ((defined ENCODER)||(defined HALL_SENSORS))
    SPD_CalcAngle(oSpeedSensor[bMotorNbr],MC_NULL);   /* if not sensorless then 2nd parameter is MC_NULL*/
#endif
#if ((defined VIEW_ENCODER_FEEDBACK)||(defined VIEW_HALL_FEEDBACK))
    SPD_CalcAngle(oSpeedSensorAux_M1,MC_NULL);  /*  only if auxiliary sensor is enabled */
#endif
  }
  else
  {
#if ((defined STATE_OBSERVER_PLL2)||(defined AUX_STATE_OBSERVER_PLL2))
    STO_Inputs.Valfa_beta = FOCVars[bMotorNbr].Valphabeta;      /* only if motor1 is sensorless*/
#endif
#if ((defined STATE_OBSERVER_CORDIC2)||(defined AUX_STATE_OBSERVER_CORDIC2))
    STO_CR_Inputs.Valfa_beta = FOCVars[bMotorNbr].Valphabeta;   /* only if motor1 is sensorless*/
#endif    
    
#if ((defined ENCODER2)||(defined HALL_SENSORS2))
    SPD_CalcAngle(oSpeedSensor[bMotorNbr],MC_NULL);   /* if not sensorless then 2nd parameter is MC_NULL*/
#endif    
#if ((defined VIEW_ENCODER_FEEDBACK2)||(defined VIEW_HALL_FEEDBACK2))
    SPD_CalcAngle(oSpeedSensorAux_M2,MC_NULL);  /*  only if auxiliary sensor is enabled */
#endif
  }
  
  hFOCreturn = FOC_CurrController(bMotorNbr);
      
  if(hFOCreturn == MC_FOC_DURATION)
  {
    STM_FaultProcessing(oSTM[bMotorNbr], MC_FOC_DURATION, 0); 
  }
  else
  {
    if (bMotorNbr == 0)
    {
#if ((defined STATE_OBSERVER_PLL)||(defined AUX_STATE_OBSERVER_PLL))
      STO_Inputs.Ialfa_beta = FOCVars[bMotorNbr].Ialphabeta;  /* only if motor0 is sensorless*/  
      
