KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/MCApplication/src/MCTasks.c
      STO_Inputs.Vbus = VBS_GetAvBusVoltage_d(oBusSensor[bMotorNbr]); /*  only for sensorless*/
#endif
#if ((defined STATE_OBSERVER_CORDIC)||(defined AUX_STATE_OBSERVER_CORDIC))
      STO_CR_Inputs.Ialfa_beta = FOCVars[bMotorNbr].Ialphabeta;  /* only if motor0 is sensorless*/  
      
      STO_CR_Inputs.Vbus = VBS_GetAvBusVoltage_d(oBusSensor[bMotorNbr]); /*  only for sensorless*/
#endif      
#if (defined STATE_OBSERVER_PLL)
      
      IsAccelerationStageReached = RUC_FirstAccelerationStageReached(oRUC_M1);
      
      SPD_CalcAngle(oSpeedSensor[bMotorNbr],&STO_Inputs);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CalcAvrgElSpeedDpp((CSTO_SPD) oSpeedSensor[bMotorNbr]); /*  Only in case of Sensor-less */
      
      if (IsAccelerationStageReached == FALSE)
      {
        STO_ResetPLL((CSTO_SPD)oSpeedSensor[bMotorNbr]);
      }    
      
      hState = STM_GetState(oSTM[bMotorNbr]);
      if((hState == START) || (hState == START_RUN)) /*  only for sensor-less*/
      {
        int16_t hObsAngle;
        hObsAngle = SPD_GetElAngle(oSpeedSensor[bMotorNbr]);        
        SPD_CalcAngle(oVSS_M1,&hObsAngle);  
      }
#endif
#if (defined STATE_OBSERVER_CORDIC)
      SPD_CalcAngle(oSpeedSensor[bMotorNbr],&STO_CR_Inputs);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CR_CalcAvrgElSpeedDpp((CSTO_CR_SPD) oSpeedSensor[bMotorNbr]); /*  Only in case of Sensor-less */
      
      hState = STM_GetState(oSTM[bMotorNbr]);
      if((hState == START) || (hState == START_RUN)) /*  only for sensor-less*/
      {
        int16_t hObsAngle;
        hObsAngle = SPD_GetElAngle(oSpeedSensor[bMotorNbr]);        
        SPD_CalcAngle(oVSS_M1,&hObsAngle);  
      }
#endif      
#if (defined(AUX_STATE_OBSERVER_PLL))
      SPD_CalcAngle(oSpeedSensorAux_M1,&STO_Inputs);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CalcAvrgElSpeedDpp((CSTO_SPD) oSpeedSensorAux_M1); /*  Only in case of Sensor-less */
#endif
#if (defined(AUX_STATE_OBSERVER_CORDIC))
      SPD_CalcAngle(oSpeedSensorAux_M1,&STO_CR_Inputs);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CR_CalcAvrgElSpeedDpp((CSTO_CR_SPD) oSpeedSensorAux_M1); /*  Only in case of Sensor-less */
#endif       
    }
    else
    {
#if ((defined STATE_OBSERVER_PLL2)||(defined AUX_STATE_OBSERVER_PLL2))
      STO_Inputs.Ialfa_beta = FOCVars[bMotorNbr].Ialphabeta;  /* only if motor1 is sensorless*/  
      
      STO_Inputs.Vbus = VBS_GetAvBusVoltage_d(oBusSensor[bMotorNbr]); /*  only for sensorless*/
#endif
#if ((defined STATE_OBSERVER_CORDIC2)||(defined AUX_STATE_OBSERVER_CORDIC2))
      STO_CR_Inputs.Ialfa_beta = FOCVars[bMotorNbr].Ialphabeta;  /* only if motor1 is sensorless*/  
      
      STO_CR_Inputs.Vbus = VBS_GetAvBusVoltage_d(oBusSensor[bMotorNbr]); /*  only for sensorless*/
#endif      
#if (defined STATE_OBSERVER_PLL2)
      
      IsAccelerationStageReached = RUC_FirstAccelerationStageReached(oRUC_M2);
      
      SPD_CalcAngle(oSpeedSensor[bMotorNbr],&STO_Inputs);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CalcAvrgElSpeedDpp((CSTO_SPD) oSpeedSensor[bMotorNbr]); /*  Only in case of Sensor-less */
      
      if (IsAccelerationStageReached == FALSE)
      {
        STO_ResetPLL((CSTO_SPD)oSpeedSensor[bMotorNbr]);
      }       
      
      hState = STM_GetState(oSTM[bMotorNbr]);
      if((hState == START) || (hState == START_RUN)) /*  only for sensor-less*/
      {
        int16_t hObsAngle;
        hObsAngle = SPD_GetElAngle(oSpeedSensor[bMotorNbr]);
        SPD_CalcAngle(oVSS_M2,&hObsAngle);
      }      
#endif
#if (defined STATE_OBSERVER_CORDIC2)
      SPD_CalcAngle(oSpeedSensor[bMotorNbr],&STO_CR_Inputs);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CR_CalcAvrgElSpeedDpp((CSTO_CR_SPD) oSpeedSensor[bMotorNbr]); /*  Only in case of Sensor-less */
      
      hState = STM_GetState(oSTM[bMotorNbr]);
      if((hState == START) || (hState == START_RUN)) /*  only for sensor-less*/
      {
        int16_t hObsAngle;
        hObsAngle = SPD_GetElAngle(oSpeedSensor[bMotorNbr]);        
        SPD_CalcAngle(oVSS_M2,&hObsAngle);
      }      
#endif      
#if (defined(AUX_STATE_OBSERVER_PLL2))
      SPD_CalcAngle(oSpeedSensorAux_M2,&STO_Inputs);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CalcAvrgElSpeedDpp((CSTO_SPD) oSpeedSensorAux_M2); /*  Only in case of Sensor-less */
#endif
#if (defined(AUX_STATE_OBSERVER_CORDIC2))
      SPD_CalcAngle(oSpeedSensorAux_M2,&STO_CR_Inputs);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CR_CalcAvrgElSpeedDpp((CSTO_CR_SPD) oSpeedSensorAux_M2); /*  Only in case of Sensor-less */
#endif      
    }    
  }
  
  FOC_array_head++;
  if (FOC_array_head == FOC_ARRAY_LENGHT)
  {
    FOC_array_head = 0;
  }
  
#endif
  
  return bMotorNbr;
}

#if defined (CCMRAM)
#if defined (__ICCARM__)
#pragma location = ".ccmram"
#elif defined (__CC_ARM)
__attribute__((section ("ccmram")))
#endif
#endif
/**
  * @brief It executes the core of FOC drive that is the controllers for Iqd 
  *        currents regulation. Reference frame transformations are carried out 
  *        accordingly to the active speed sensor. It must be called periodically
  *        when new motor currents have been converted
  * @param this related object of class CFOC.
  * @retval int16_t It returns MC_NO_FAULTS if the FOC has been ended before 
  *         next PWM Update event, MC_FOC_DURATION otherwise
  */
#pragma inline
uint16_t FOC_CurrController(uint8_t bMotor)
{
  Curr_Components Iab, Ialphabeta, Iqd;
#if defined(HFINJECTION) || (defined(DUALDRIVE) && defined(HFINJECTION2))
  Curr_Components IqdHF = {0,0};
#endif
  Volt_Components Valphabeta, Vqd;
  int16_t hElAngledpp;
  uint16_t hCodeError;
  
  hElAngledpp = SPD_GetElAngle(STC_GetSpeedSensor(oSTC[bMotor]));
  
  PWMC_GetPhaseCurrents(oCurrSensor[bMotor], &Iab);
  
  Ialphabeta = MCM_Clarke(Iab);
  
  Iqd = MCM_Park(Ialphabeta, hElAngledpp);
  
