KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/MCApplication/src/MCTasks.c
#if defined(HFINJECTION) || (defined(DUALDRIVE) && defined(HFINJECTION2))
  if (oHFI[bMotor])
  {
    IqdHF = Iqd; /* Stores the Iqd not filtered */
    Iqd = HFI_FP_PreProcessing(oHFI[bMotor], Iqd);
  }
#endif
  
  Vqd.qV_Component1 = PI_Controller(oPIDIq[bMotor], 
            (int32_t)(FOCVars[bMotor].Iqdref.qI_Component1) - Iqd.qI_Component1);
  
  Vqd.qV_Component2 = PI_Controller(oPIDId[bMotor], 
            (int32_t)(FOCVars[bMotor].Iqdref.qI_Component2) - Iqd.qI_Component2);  
  
#if defined(FEED_FORWARD_CURRENT_REGULATION) || (defined(DUALDRIVE) && defined(FEED_FORWARD_CURRENT_REGULATION2))
  if (oFF[bMotor])
  {
    Vqd = FF_VqdConditioning(oFF[bMotor],Vqd);
  }
#endif
  
  FOCVars[bMotor].Vqd = Vqd;
  
#if defined(HFINJECTION) || (defined(DUALDRIVE) && defined(HFINJECTION2))
  if (oHFI[bMotor])
  {
    Vqd = HFI_FP_VqdConditioning(oHFI[bMotor], Vqd);
  }
#endif
  
#if defined(OPEN_LOOP) || (defined(DUALDRIVE) && defined(OPEN_LOOP2))
  if (oOL[bMotor])
  {
    Vqd = OL_VqdConditioning(oOL[bMotor]);
  }
#endif
  
  Vqd = Circle_Limitation(oCLM[bMotor], Vqd);
  
  Valphabeta = MCM_Rev_Park(Vqd, hElAngledpp);
  
  hCodeError = PWMC_SetPhaseVoltage(oCurrSensor[bMotor], Valphabeta);
  
  FOCVars[bMotor].Iab = Iab;
  FOCVars[bMotor].Ialphabeta = Ialphabeta;  
  FOCVars[bMotor].Iqd = Iqd;    
  FOCVars[bMotor].Valphabeta = Valphabeta;
  FOCVars[bMotor].hElAngle = hElAngledpp;

#if defined(HFINJECTION) || (defined(DUALDRIVE) && defined(HFINJECTION2))
  FOCVars[bMotor].IqdHF = IqdHF;
#endif
  
#if defined(FLUX_WEAKENING) || (defined(DUALDRIVE) && defined(FLUX_WEAKENING2))
  if (oFW[bMotor])
  {
    FW_DataProcess(oFW[bMotor], Vqd); // Not HFI ???
  }
#endif
  
#if defined(FEED_FORWARD_CURRENT_REGULATION) || (defined(DUALDRIVE) && defined(FEED_FORWARD_CURRENT_REGULATION2))
  if (oFF[bMotor])
  {
    FF_DataProcess(oFF[bMotor]);
  }
#endif
  
#if defined(HFINJECTION) || (defined(DUALDRIVE) && defined(HFINJECTION2))
  if (oHFI[bMotor])
  {
    HFI_FP_DataProcess(oHFI[bMotor], IqdHF);
  }
#endif
  
  return(hCodeError);
}

/**
* @brief  This function requests a user-defined regular conversion. All user 
*         defined conversion requests must be performed inside routines with the 
*         same priority level. If previous regular conversion request is pending
*         this function has no effect, for this reason is better to call the 
*         MC_RegularConvState and check if the state is UDRC_STATE_IDLE before 
*         to call MC_RequestRegularConv.
* @param  bChannel ADC channel used for the regular conversion.
* @param  bSamplTime Sampling time selection, ADC_SampleTime_nCycles defined in 
*         stm32fxxx_adc.h see ADC_sampling_times.
*/
void MC_RequestRegularConv(uint8_t bChannel, uint8_t bSamplTime)
{
  ADConv_t ADConv_struct;
  if (UDC_State == UDRC_STATE_IDLE)
  {
    ADConv_struct.Channel = bChannel;
    ADConv_struct.SamplTime = bSamplTime;
    PWMC_ADC_SetSamplingTime(oCurrSensor[M1],ADConv_struct);
    UDC_State = UDRC_STATE_REQUESTED;
    UDC_Channel = bChannel;
  }
}

/**
* @brief  Get the last user-defined regular conversion.
* @retval uint16_t It returns converted value or oxFFFF for conversion error.
*         This function returns a valid result if the state returned by 
*         MC_RegularConvState is UDRC_STATE_EOC.
*/
uint16_t MC_GetRegularConv(void)
{
  uint16_t hRetVal = 0xFFFFu;
  if (UDC_State == UDRC_STATE_EOC)
  {
    hRetVal = UDC_ConvertedValue;
    UDC_State = UDRC_STATE_IDLE;
  }
  return hRetVal;
}

/**
* @brief  Use this function to know the status of the last requested regular 
*         conversion.
* @retval UDRC_State_t The state of the last user-defined regular conversion. 
*         It can be one of the following values:
*         UDRC_STATE_IDLE no regular conversion request pending.
*         UDRC_STATE_REQUESTED regular conversion has been requested and not 
*         completed.
*         UDRC_STATE_EOC regular conversion has been completed but not readed 
*         from the user.
*/
UDRC_State_t MC_RegularConvState(void)
{
  return UDC_State;
}

/**
  * @brief  It executes safety checks (e.g. bus voltage and temperature) for all
  *         drive instances. Faults flags are also here updated     
  * @param  None
  * @retval None
  */
void TSK_SafetyTask(void)
{
#if defined(SINGLEDRIVE)

    #if (ON_OVER_VOLTAGE == TURN_OFF_PWM)
        TSK_SafetyTask_PWMOFF(M1);
    #elif (ON_OVER_VOLTAGE == TURN_ON_R_BRAKE)
        TSK_SafetyTask_RBRK(M1);
    #elif (ON_OVER_VOLTAGE == TURN_ON_LOW_SIDES)
        TSK_SafetyTask_LSON(M1);
    #endif

#elif defined(DUALDRIVE)

    /* First drive */
    #if (ON_OVER_VOLTAGE == TURN_OFF_PWM)
        TSK_SafetyTask_PWMOFF(M1);
    #elif (ON_OVER_VOLTAGE == TURN_ON_R_BRAKE)
        TSK_SafetyTask_RBRK(M1);
    #elif (ON_OVER_VOLTAGE == TURN_ON_LOW_SIDES)
        TSK_SafetyTask_LSON(M1);
    #endif
    
    /* Second drive */
    #if (ON_OVER_VOLTAGE2 == TURN_OFF_PWM)
        TSK_SafetyTask_PWMOFF(M2);
    #elif (ON_OVER_VOLTAGE2 == TURN_ON_R_BRAKE)
        TSK_SafetyTask_RBRK(M2);
    #elif (ON_OVER_VOLTAGE2 == TURN_ON_LOW_SIDES)
        TSK_SafetyTask_LSON(M2);
    #endif

#endif

    /* User conversion execution */
  if (UDC_State == UDRC_STATE_REQUESTED)
  {
    UDC_ConvertedValue = PWMC_ExecRegularConv (oCurrSensor[M1], UDC_Channel);
    UDC_State = UDRC_STATE_EOC;
  }
}

/**
  * @brief  Safety task implementation if ON_OVER_VOLTAGE == TURN_OFF_PWM   
  * @param  bMotor Motor reference number defined 
  *         \link Motors_reference_number here \endlink
  * @retval None
  */
void TSK_SafetyTask_PWMOFF(uint8_t bMotor)
{
  uint16_t CodeReturn;

  CodeReturn = TSNS_CalcAvTemp(oTemperatureSensor[bMotor]); /* Clock temperature sensor and check for fault. It returns MC_OVER_TEMP or MC_NO_ERROR */
  CodeReturn |= PWMC_CheckOverCurrent(oCurrSensor[bMotor]); /* Clock current sensor and check for fault. It return MC_BREAK_IN or MC_NO_FAULTS (for STM32F30x can return MC_OVER_VOLT in case of HW Overvoltage) */
  CodeReturn |= VBS_CalcAvVbus(oBusSensor[bMotor]); /* Clock the bus voltage sensor and check for fault. It returns MC_OVER_VOLT or MC_UNDER_VOLT or MC_NO_ERROR */
  
  STM_FaultProcessing(oSTM[bMotor], CodeReturn, ~CodeReturn); /* Update the STM according error code */
  
