KHIEM2812/auto_quad_fc/stm32_foc_sdk/STM32 PMSM FOC LIBv4.0/Web/MCApplication/src/MCTasks.c
  switch (STM_GetState(oSTM[bMotor])) /* Acts on PWM outputs in case of faults */
  {
  case FAULT_NOW:   
    PWMC_SwitchOffPWM(oCurrSensor[bMotor]);
    FOC_Clear(bMotor);
    MPM_Clear(oMPM[bMotor]);
    break;
  case FAULT_OVER:
    PWMC_SwitchOffPWM(oCurrSensor[bMotor]);
    break;
  default:
    break;    
  }
}

/**
  * @brief  Safety task implementation if ON_OVER_VOLTAGE == TURN_ON_R_BRAKE   
  * @param  motor Motor reference number defined 
  *         \link Motors_reference_number here \endlink
  * @retval None
  */
void TSK_SafetyTask_RBRK(uint8_t bMotor)
{
  uint16_t CodeReturn;
  uint16_t BusVoltageFaultsFlag;
  
  /* Brake resistor management */
  BusVoltageFaultsFlag = VBS_CalcAvVbus(oBusSensor[bMotor]); /* Clock the bus voltage sensor and check for fault. It returns MC_OVER_VOLT or MC_UNDER_VOLT or MC_NO_ERROR */
  
  if (BusVoltageFaultsFlag == MC_OVER_VOLT)
  {
    DOUT_SetOutputState(oR_Brake[bMotor], ACTIVE); 
  }
  else
  {
    DOUT_SetOutputState(oR_Brake[bMotor], INACTIVE);    
  }
  
  CodeReturn = TSNS_CalcAvTemp(oTemperatureSensor[bMotor]); /* Clock temperature sensor and check for fault. It returns MC_OVER_TEMP or MC_NO_ERROR */
  CodeReturn |= PWMC_CheckOverCurrent(oCurrSensor[bMotor]); /* Clock current sensor and check for fault. It return MC_BREAK_IN or MC_NO_FAULTS (for STM32F30x can return MC_OVER_VOLT in case of HW Overvoltage) */
  CodeReturn |= (BusVoltageFaultsFlag & MC_UNDER_VOLT); /* MC_UNDER_VOLT generates fault, MC_OVER_VOLT doesn't generate fault */
    
  STM_FaultProcessing(oSTM[bMotor], CodeReturn, ~CodeReturn); /* Update the STM according error code */
  
  switch (STM_GetState(oSTM[bMotor]))
  {
  case FAULT_NOW:   
    PWMC_SwitchOffPWM(oCurrSensor[bMotor]);
    FOC_Clear(bMotor);
    MPM_Clear(oMPM[bMotor]);
    break;
  case FAULT_OVER:
    PWMC_SwitchOffPWM(oCurrSensor[bMotor]);
    break;
  default:
    break;    
  }
}

/**
  * @brief  Safety task implementation if ON_OVER_VOLTAGE == TURN_ON_LOW_SIDES   
  * @param  motor Motor reference number defined 
  *         \link Motors_reference_number here \endlink
  * @retval None
  */
void TSK_SafetyTask_LSON(uint8_t bMotor)
{
  uint16_t CodeReturn;
  uint16_t OverVoltageFlag;
  
  bool TurnOnLowSideAction = PWMC_GetTurnOnLowSidesAction(oCurrSensor[bMotor]);
  
  CodeReturn = TSNS_CalcAvTemp(oTemperatureSensor[bMotor]); /* Clock temperature sensor and check for fault. It returns MC_OVER_TEMP or MC_NO_ERROR */
  CodeReturn |= PWMC_CheckOverCurrent(oCurrSensor[bMotor]); /* Clock current sensor and check for fault. It return MC_BREAK_IN or MC_NO_FAULTS (for STM32F30x can return MC_OVER_VOLT in case of HW Overvoltage) */
  OverVoltageFlag = VBS_CalcAvVbus(oBusSensor[bMotor]);     /* Clock the bus voltage sensor and check for fault. It returns MC_OVER_VOLT or MC_UNDER_VOLT or MC_NO_ERROR */
  CodeReturn |= OverVoltageFlag;                       /* Over/Under voltage code errors generate faults. */
  STM_FaultProcessing(oSTM[bMotor], CodeReturn, ~CodeReturn); /* Update the STM according error code */
  
  if ((OverVoltageFlag == MC_OVER_VOLT) && (TurnOnLowSideAction == FALSE))
  {
    /* Start turn on low side action */
    PWMC_SwitchOffPWM(oCurrSensor[bMotor]); /* Required before PWMC_TurnOnLowSides */
#if (HW_OV_CURRENT_PROT_BYPASS == ENABLE)
    DOUT_SetOutputState(oOCPDisabling[bMotor], ACTIVE); /* Disable the OCP */
#endif     
    PWMC_TurnOnLowSides(oCurrSensor[bMotor]); /* Turn on Low side switches */
  }
  else
  {
    switch (STM_GetState(oSTM[bMotor])) /* Is state equal to FAULT_NOW or FAULT_OVER */
    {
    case IDLE:
      {
        /* After a OV occurs the turn on low side action become active. It is released just after a fault acknowledge -> state == IDLE */
        if (TurnOnLowSideAction == TRUE)
        {
          /* End of TURN_ON_LOW_SIDES action */
#if (HW_OV_CURRENT_PROT_BYPASS == ENABLE)
          DOUT_SetOutputState(oOCPDisabling[bMotor], INACTIVE); /* Re-enable the OCP */
#endif   
          PWMC_SwitchOffPWM(oCurrSensor[bMotor]);  /* Switch off the PWM */
        }        
      }
      break;
    case FAULT_NOW:
      {
        if (TurnOnLowSideAction == FALSE)
        {
          /* Switching off the PWM if fault occurs must be done just if TURN_ON_LOW_SIDES action is not in place */
          PWMC_SwitchOffPWM(oCurrSensor[bMotor]);
          FOC_Clear(bMotor);
          MPM_Clear(oMPM[bMotor]);
        }
      }
      break;
    case FAULT_OVER:
      {
        if (TurnOnLowSideAction == FALSE)
        {
          /* Switching off the PWM if fault occurs must be done just if TURN_ON_LOW_SIDES action is not in place */
          PWMC_SwitchOffPWM(oCurrSensor[bMotor]);
        }
      }
      break;
    default:
      break;    
    }
  }
}

#ifdef DUALDRIVE
#if defined (CCMRAM_ENABLED)
#if defined (__ICCARM__)
#pragma location = ".ccmram"
#elif defined (__CC_ARM)
__attribute__((section ("ccmram")))
#endif
#endif
/**
  * @brief  This function is called by TIMx_UP_IRQHandler in case of dual MC and
  *         it allows to reserve half PWM period in advance the FOC execution on
  *         ADC ISR
  * @param  oDrive pointer to a CFOC object
  * @retval None
  */
void TSK_DualDriveFIFOUpdate(void *oDrive)
{
  FOC_array[FOC_array_tail] = oDrive;
  FOC_array_tail++;
  if (FOC_array_tail == FOC_ARRAY_LENGHT)
  {
    FOC_array_tail = 0;
  }
}
#endif

/**
  * @brief  This function returns the reference of the MCInterface relative to 
  *         the selected drive. 
  * @param  bMotor Motor reference number defined 
  *         \link Motors_reference_number here \endlink
  * @retval CMCI Reference to MCInterface relative to the selected drive.
  *         Note: it can be MC_NULL if MCInterface of selected drive is not
  *         allocated.
  */
CMCI GetMCI(uint8_t bMotor)
{
  CMCI retVal = MC_NULL;
  if ((oMCInterface != MC_NULL) && (bMotor < MC_NUM))
  {
    retVal = oMCInterface[bMotor];
  }
  return retVal;
}

/**
  * @brief  This function returns the reference of the MCTuning relative to 
  *         the selected drive.
  * @param  bMotor Motor reference number defined 
  *         \link Motors_reference_number here \endlink
  * @retval CMCI Reference to MCInterface relative to the selected drive.
  *         Note: it can be MC_NULL if MCInterface of selected drive is not
  *         allocated.
  */
CMCT GetMCT(uint8_t bMotor)
{
  CMCT retVal = MC_NULL;
  if ((oMCTuning != MC_NULL) && (bMotor < MC_NUM))
  {
    retVal = oMCTuning[bMotor];
  }
  return retVal;
}

/**
  * @brief  It is executed when a general hardware failure has been detected by
  *         the microcontroller and is used to put the system in safety 
  *         condition.
  * @param  None
  * @retval None
  */
void TSK_HardwareFaultTask(void)
{
  PWMC_SwitchOffPWM(oCurrSensor[M1]);  
  STM_FaultProcessing(oSTM[M1], MC_SW_ERROR, 0);
  
#ifdef DUALDRIVE
  PWMC_SwitchOffPWM(oCurrSensor[M2]);
  STM_FaultProcessing(oSTM[M2], MC_SW_ERROR, 0);
#endif
}

/******************* (C) COPYRIGHT 2014 STMicroelectronics *****END OF FILE****/
